NetologySlow/src/Documents/НачислениеПоОкладу/НачислениеПоОкладу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПоОкладу</name>
  <registerRecords>CalculationRegister.Зарплата</registerRecords>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.НачисленияУдержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОклада</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРабочихДней</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаОдногоДня</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NetologySlow/src/CalculationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Зарплата</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.Календарь</schedule>
  <scheduleValue>InformationRegister.Календарь.Resource.РабочихДней</scheduleValue>
  <scheduleDate>InformationRegister.Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.НачисленияУдержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

NetologySlow/src/Documents/НачислениеПоОкладу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)   
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НачислениеПоОкладуСотрудники.Ссылка КАК Ссылка,
	|	НачислениеПоОкладуСотрудники.Сотрудник.Оклад КАК СотрудникОклад
	|ИЗ
	|	Документ.НачислениеПоОкладу.Сотрудники КАК НачислениеПоОкладуСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО НачислениеПоОкладуСотрудники.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	НачислениеПоОкладуСотрудники.Ссылка = &Ссылка" );     
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);    
	
	РезультатЗапроса=Запрос.Выполнить();
	
	Выборка=РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
		
		// регистр Зарплата  
		Движения.Зарплата.Очистить();
		Движения.Зарплата.Записывать = Истина;
		Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
			Движение = Движения.Зарплата.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ОплатаПоОкладу;
			Движение.ПериодДействияНачало = НачалоМесяца(Дата); 
			Движение.ПериодДействияКонец = КонецМесяца(Дата);
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Показатель = ТекСтрокаСотрудники.СуммаОклада;
		КонецЦикла; 
		
		Движения.Зарплата.Записать(); 
		
		Для каждого Движение Из Движения.Зарплата Цикл 
			
			Отбор = Новый Структура("Регистратор, Сотрудник", Ссылка, Движение.Сотрудник);
			Норма = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, 
			ВидПериодаРегистраРасчета.ПериодДействия)[0].РабочихДней;
			Факт = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, 
			ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].РабочихДней;
			Движение.Сумма = ?(Норма = 0, 0, Движение.Показатель * Факт / Норма);
			
			
			//План = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия);
			//Факт = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия);   
			//
			//Результат = Движение.Показатель / План [0].РабочихДней * Факт[0].РабочихДней;        
			//
			//Движение.Сумма = Результат; 
			
		КонецЦикла;  
		
		Движения.Зарплата.Записать(, Истина);   
		
	КонецЦикла;
		
	КонецПроцедуры
